_protected/frontend/models/PaisQuery.php

SELECT * FROM `pais`
---
    public function all($db = null)
    {
        return parent::all($db);