_protected/frontend/models/PasswordResetRequestForm.php

    public function sendEmail()
    {
        /* @var $user User */
        $user = User::findOne([
            'status' => User::STATUS_ACTIVE,
            'email' => $this->email,
        ]);

        if ($user)
        {
            $user->generatePasswordResetToken();

            if ($user->save())
---
SELECT * FROM `user` WHERE (`status`=10) AND (`email`='jofre.jonathan@gmail.com')
UPDATE `user` SET `password_reset_token`='KpULXXyJzJKUx44wLwwbNiFYReZzh7jl_1446066292', `updated_at`=1446066292 WHERE `id`=2