_protected/frontend/models/ResetPasswordForm.php

    public function resetPassword()
    {
        $user = $this->_user;
        $user->setPassword($this->password);
        $user->removePasswordResetToken();

        return $user->save();
---
UPDATE `user` SET `password_hash`='$2y$13$zbOM5g4J3ceCHKpOhUJPU.4KH.VIju0cMUINOFl4yvDVy.Ejg5cxO', `password_reset_token`=NULL, `updated_at`=1446131059 WHERE `id`=7