_protected/frontend/models/SignupForm.php

    public function signup()
    {
        $user = new User();

        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->status = $this->status;
        $user->telefono = $this->telefono;
        $user->telefonoalt = $this->telefonoalt;
        $user->localidad_idlocalidad = $this->localidad_idlocalidad;
        // if scenario is "rna" we will generate account activation token
        if ($this->scenario === 'rna')
        {
            $user->generateAccountActivationToken();
        }

        // if user is saved and role is assigned return user object
        return $user->save() && RbacHelper::assignRole($user->getId()) ? $user : null;
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `telefono`, `telefonoalt`, `localidad_idlocalidad`, `account_activation_token`, `created_at`, `updated_at`) VALUES ('matias', 'matiasjof@gmail.com', '$2y$13$31dJX9sXBUIgDQBWiZFv1Ou/X2rOaVb05pOlEVtG9Ua3v7lEIZYE6', 'VhL9xboandEbS5Y9VnPfI7NCf6RNQn4B', 1, '(2323) 131-312312', '', 609, 'sMNVQsqy5PSyNLEbbnQ9h3F6KXkJZmRi_1446130844', 1446130844, 1446130844)

    public function getSubCatList($id)
    {
        $resultado=[];
        $countProvincias = \common\models\base\Provincia::find()
            ->where(['pais_idpais' => $id])
            ->count();
---
SELECT COUNT(*) FROM `provincia` WHERE `pais_idpais`='2'

    public function getProdList($cat_id, $subcat_id)
    {
        $resultado=[];
        $outV=[];
        $countLocalidades = \common\models\base\Localidad::find()
            ->where(['provincia_idprovincia' => $subcat_id])
            ->count();
---
SELECT COUNT(*) FROM `localidad` WHERE `provincia_idprovincia`='Loading ...'