_protected/common/models/AvisoSearch.php

    public function searchIndex($params, $pageSize = 2, $published = true)
    {
        $query = Aviso::find();

        // this means that editor is trying to see articles
        // we will allow him to see published ones and drafts made by him
        if ($published === true)
        {
            $query->where(['estado' => Aviso::STATUS_PUBLICADO]);
            $query->andWhere(['eliminado' => 0]);
            $query->limit(Aviso::CANTAVISOSDEST)->all();
---
SELECT * FROM `aviso` WHERE (`estado`=2) AND (`eliminado`=0) LIMIT 10