_protected/common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => User::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='matias') AND (`status`=10)

    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token))
        {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => User::STATUS_ACTIVE,
        ]);
---
SELECT * FROM `user` WHERE (`password_reset_token`='t-4hvrmwkrYToZIDZb-A4E7txVL-czeI_1446131021') AND (`status`=10)

    public static function findByAccountActivationToken($token)
    {
        return static::findOne([
            'account_activation_token' => $token,
            'status' => User::STATUS_NOT_ACTIVE,
        ]);
---
SELECT * FROM `user` WHERE (`account_activation_token`='_SmlrIzmb_GX-pSszKBqENC1GAsroCjk_1446128751') AND (`status`=1)

    public static function userExists($username, $password, $scenario)
    {
        // if scenario is 'lwe', we need to check email, otherwise we check username
        $field = ($scenario === 'lwe') ? 'email' : 'username';

        if ($user = static::findOne([$field => $username]))
---
SELECT * FROM `user` WHERE `username` IS NULL